AirCreateReservationReq.xml

<?xml version="1.0" encoding="utf-8"?>
            <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
                        <s:Header/>
                        <s:Body>
                          <univ:AirCreateReservationReq xmlns:common_v41_0="http://www.travelport.com/schema/common_v41_0" xmlns:univ="http://www.travelport.com/schema/universal_v41_0" AuthorizedBy="user" RetainReservation="None"  xmlns="http://www.travelport.com/schema/air_v41_0" TraceId="1982222261_1601282416" TargetBranch="P3358955">
                            <BillingPointOfSaleInfo  xmlns="http://www.travelport.com/schema/common_v41_0" OriginApplication="UAPI" ></BillingPointOfSaleInfo>
                            <BookingTraveler xmlns="http://www.travelport.com/schema/common_v41_0" Key="0" TravelerType="ADT" DOB="1990-09-28" Gender="M">
                                        <BookingTravelerName Prefix="MR" First="HIMANSHU" Last="MALIK" />
                                        <PhoneNumber Number="8767881524" Type="Mobile" />
                                        <Email EmailID="Rohit@misbaholidays.com" Type="P" />
                                        <SSR Carrier="AI" SegmentRef="O5nb3SPc1BKAdGOUzCAAAA==" Status="NN" Type="AVML" />
                                        
                                        <SSR FreeText="P/IN/8884401698/IN/28Sep90/M/28Sep25/MALIK/HIMANSHU" Status="HK" Type="DOCS" />
                                      <SSR xmlns="http://www.travelport.com/schema/common_v41_0" Key="1" Type="GSTA" Carrier="AI" Status="NN" FreeText="/IND/HAWARE FANTASIA BUSINESS PARK/VASHI/NAVI MUMBAI"/><SSR xmlns="http://www.travelport.com/schema/common_v41_0" Key="2" Type="GSTN" Carrier="AI" Status="NN" FreeText="/IND/27AAHCM0059P1Z1/MISBA HOLIDAYS PVT LTD"/><SSR xmlns="http://www.travelport.com/schema/common_v41_0" Key="3" Type="GSTP" Carrier="AI" Status="NN" FreeText="/IND/022 61475786/022 61475786"/><SSR xmlns="http://www.travelport.com/schema/common_v41_0" Key="4" Type="GSTE" Carrier="AI" Status="NN" FreeText="/IND/Ejaz//misbaholidays.com"/><Address>
                                       <AddressName>HIMANSHU</AddressName>
                                       <Street>TEST</Street>
                                       <City>TEST</City>
                                       <State>TEST</State>
                                       <PostalCode>560100</PostalCode>
                                       <Country>IN</Country>
                                    </Address>
                                     </BookingTraveler>
                            <FormOfPayment xmlns="http://www.travelport.com/schema/common_v41_0"  Type="Cash"></FormOfPayment>
                            

  <AirPricingSolution xmlns="http://www.travelport.com/schema/air_v41_0" Key="O5nb3SPc1BKAfGOUzCAAAA==" TotalPrice="INR2905" BasePrice="INR2330" ApproximateTotalPrice="INR2905" ApproximateBasePrice="INR2330" Taxes="INR575" ApproximateTaxes="INR575" QuoteDate="2020-09-28">
    <AirSegment Key="O5nb3SPc1BKAdGOUzCAAAA==" Group="0" Carrier="AI" FlightNumber="411" ProviderCode="1G" Origin="DEL" Destination="LKO" DepartureTime="2020-09-30T07:05:00.000+05:30" ArrivalTime="2020-09-30T08:15:00.000+05:30" FlightTime="70" TravelTime="70" Distance="263" ClassOfService="S" Equipment="32B" ChangeOfPlane="false" OptionalServicesIndicator="false" AvailabilitySource="S" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="O and D cache or polled status used with different local status" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked">
      <CodeshareInfo OperatingCarrier="AI"/>
      <AirAvailInfo ProviderCode="1G"/>
      <FlightDetails Key="O5nb3SPc1BKAeGOUzCAAAA==" Origin="DEL" Destination="LKO" DepartureTime="2020-09-30T07:05:00.000+05:30" ArrivalTime="2020-09-30T08:15:00.000+05:30" FlightTime="70" TravelTime="70" Distance="263"/>
    </AirSegment>
    <AirPricingInfo Key="O5nb3SPc1BKAhGOUzCAAAA==" TotalPrice="INR2905" BasePrice="INR2330" ApproximateTotalPrice="INR2905" ApproximateBasePrice="INR2330" ApproximateTaxes="INR575" Taxes="INR575" LatestTicketingTime="2020-09-30T23:59:00.000+05:30" PricingMethod="Guaranteed" IncludesVAT="false" ETicketability="Yes" PlatingCarrier="AI" ProviderCode="1G">
      <FareInfo Key="O5nb3SPc1BKAmGOUzCAAAA==" FareBasis="SIP" PassengerTypeCode="ADT" Origin="DEL" Destination="LKO" EffectiveDate="2020-09-28T14:08:00.000+05:30" DepartureDate="2020-09-30" Amount="INR2330" NotValidBefore="2020-09-30" NotValidAfter="2020-09-30">
        <FareRuleKey FareInfoRef="O5nb3SPc1BKAmGOUzCAAAA==" ProviderCode="1G">6UUVoSldxwhjDeEQUfpn3MbKj3F8T9EyxsqPcXxP0TLGyo9xfE/RMsuWFfXVd1OAly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA4U/UuC8/Pq3NAF/izIfuYdfHMK8e3nzhmoKQGai5xNzjA6MsGNvMT1SD5QULEHOHadwjMHbhzGec7noBKk7SldlmzapJzTWH8siOHFaFMf8hf6E18cRejGVqfCTByZWB98KxJ35Bj3Drxa4kYfhAhHqNbjwzJx7oo0sKBvhNXxaFHpjnmZFIWFmrnLh1p/LTEACA4xcw3/+ly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA4q+cJFUBzriwNmwgE7MqQt7PHybnt8kEFNFX/4N2RTghOW5Q29uMMJY/MdLiTjsbGbeWZkRGLN3KAxevs8wf8A=</FareRuleKey>
      </FareInfo>
      <BookingInfo BookingCode="S" CabinClass="Economy" FareInfoRef="O5nb3SPc1BKAmGOUzCAAAA==" SegmentRef="O5nb3SPc1BKAdGOUzCAAAA=="/>
      <TaxInfo Category="K3" Amount="INR125" Key="O5nb3SPc1BKAiGOUzCAAAA=="/>
      <TaxInfo Category="P2" Amount="INR189" Key="O5nb3SPc1BKAjGOUzCAAAA=="/>
      <TaxInfo Category="WO" Amount="INR91" Key="O5nb3SPc1BKAkGOUzCAAAA=="/>
      <TaxInfo Category="YR" Amount="INR170" Key="O5nb3SPc1BKAlGOUzCAAAA=="/>
      <FareCalc>DEL AI LKO 2330SIP INR2330END</FareCalc>
      <PassengerType Code="ADT" BookingTravelerRef="0"/>
      <ChangePenalty>
        <Percentage>0.00</Percentage>
      </ChangePenalty>
      <BaggageAllowances>
        <BaggageAllowanceInfo TravelerType="ADT" Origin="DEL" Destination="LKO" Carrier="AI">
          <URLInfo>
            <URL>VIEWTRIP.TRAVELPORT.COM/BAGGAGEPOLICY/AI</URL>
          </URLInfo>
          <TextInfo>
            <Text>25K</Text>
            <Text>BAGGAGE DISCOUNTS MAY APPLY BASED ON FREQUENT FLYER STATUS/ ONLINE CHECKIN/FORM OF PAYMENT/MILITARY/ETC.</Text>
          </TextInfo>
          <BagDetails ApplicableBags="1stChecked">
            <BaggageRestriction>
              <TextInfo>
                <Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text>
              </TextInfo>
            </BaggageRestriction>
          </BagDetails>
          <BagDetails ApplicableBags="2ndChecked">
            <BaggageRestriction>
              <TextInfo>
                <Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text>
              </TextInfo>
            </BaggageRestriction>
          </BagDetails>
        </BaggageAllowanceInfo>
        <CarryOnAllowanceInfo Origin="DEL" Destination="LKO" Carrier="AI">
          <TextInfo>
            <Text>8K</Text>
          </TextInfo>
          <CarryOnDetails ApplicableCarryOnBags="1" BasePrice="" TotalPrice="">
            <BaggageRestriction>
              <TextInfo>
                <Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text>
              </TextInfo>
            </BaggageRestriction>
          </CarryOnDetails>
          <CarryOnDetails ApplicableCarryOnBags="2" BasePrice="" TotalPrice="">
            <BaggageRestriction>
              <TextInfo>
                <Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text>
              </TextInfo>
            </BaggageRestriction>
          </CarryOnDetails>
        </CarryOnAllowanceInfo>
      </BaggageAllowances>
    </AirPricingInfo>
    <FareNote Key="O5nb3SPc1BKA7GOUzCAAAA==">LAST DATE TO PURCHASE TICKET: 30SEP20</FareNote>
    <FareNote Key="O5nb3SPc1BKA8GOUzCAAAA==">TICKETING AGENCY 52MX</FareNote>
    <FareNote Key="O5nb3SPc1BKA9GOUzCAAAA==">DEFAULT PLATING CARRIER AI</FareNote>
    <FareNote Key="O5nb3SPc1BKA+GOUzCAAAA==">FARE HAS A PLATING CARRIER RESTRICTION</FareNote>
    <FareNote Key="O5nb3SPc1BKA/GOUzCAAAA==">E-TKT REQUIRED</FareNote>
    <FareNote Key="O5nb3SPc1BKAAHOUzCAAAA==">TICKETING FEES MAY APPLY</FareNote>
    <HostToken xmlns="http://www.travelport.com/schema/common_v41_0" Key="O5nb3SPc1BKAgGOUzCAAAA==">GFB10101ADT00  01SIP                                   010001#GFB200010101NADTV3302AI0406900001997R#GFMCEIP302NAI04 AI ADTSIP</HostToken>
  </AirPricingSolution>

                            <ActionStatus ProviderCode="1G" TicketDate="T*" Type="ACTIVE" QueueCategory="01" xmlns="http://www.travelport.com/schema/common_v41_0" ></ActionStatus>
                            <SpecificSeatAssignment xmlns="http://www.travelport.com/schema/air_v41_0" SeatId="5C" BookingTravelerRef="0" SegmentRef="O5nb3SPc1BKAdGOUzCAAAA=="/>
                            </univ:AirCreateReservationReq>
                        </s:Body>
                        </s:Envelope>